In [61]:
import pandas as pd

In [62]:
from pandas import Series, DataFrame

In [63]:
obj = pd.Series([12,-4,11,19])
obj

0    12
1    -4
2    11
3    19
dtype: int64

In [64]:
obj.values

array([12, -4, 11, 19], dtype=int64)

In [65]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [66]:
obj1= pd.Series([12,-4,11,19], index =['a', 'b', 'c', 'z'])
obj1

a    12
b    -4
c    11
z    19
dtype: int64

In [67]:
obj1.values

array([12, -4, 11, 19], dtype=int64)

In [68]:
obj1.index

Index(['a', 'b', 'c', 'z'], dtype='object')

In [69]:
obj1['c']

11

In [70]:
obj1['z'] = 16

In [71]:
obj1

a    12
b    -4
c    11
z    16
dtype: int64

In [72]:
obj1[['a', 'z', 'c']]

a    12
z    16
c    11
dtype: int64

In [73]:
obj1[obj1>10]

a    12
c    11
z    16
dtype: int64

In [74]:
obj1*2

a    24
b    -8
c    22
z    32
dtype: int64

In [75]:
obj1**2

a    144
b     16
c    121
z    256
dtype: int64

In [19]:
import numpy as np
np.exp(obj1)

a    1.627548e+05
b    1.831564e-02
c    5.987414e+04
z    8.886111e+06
dtype: float64

In [76]:
'a' in obj1

True

In [77]:
'm' in obj1

False

In [92]:
fdata =  {'karachi':1000,'lahore':2000, 'islamabad':3000, 'gujrat':1500}

In [93]:
obj2= pd.Series(fdata)

In [94]:
obj2

karachi      1000
lahore       2000
islamabad    3000
gujrat       1500
dtype: int64

In [83]:
sdata = ['California', 'karachi', 'lahore', 'islamabad']

In [84]:
obj3 = pd.Series(fdata, index= sdata)

In [85]:
obj3

California       NaN
karachi       1000.0
lahore        2000.0
islamabad     3000.0
dtype: float64

In [87]:
pd.isnull(obj3)

California     True
karachi       False
lahore        False
islamabad     False
dtype: bool

In [88]:
pd.notnull(obj3)

California    False
karachi        True
lahore         True
islamabad      True
dtype: bool

In [89]:
obj2

karachi      1000
lahore       2000
islamabad    3000
gujrat       1500
dtype: int64

In [90]:
obj3

California       NaN
karachi       1000.0
lahore        2000.0
islamabad     3000.0
dtype: float64

In [91]:
obj2 + obj3

California       NaN
gujrat           NaN
islamabad     6000.0
karachi       2000.0
lahore        4000.0
dtype: float64

In [105]:
obj3.name = 'Population'

In [106]:
obj3.index.name = 'state'

In [107]:
obj3

state
California       NaN
karachi       1000.0
lahore        2000.0
islamabad     3000.0
Name: Population, dtype: float64

In [112]:
obj

a    12
b    -4
c    11
d    19
dtype: int64

In [117]:
obj.index = ['a','b', 'c', 'd']

In [118]:
obj

a    12
b    -4
c    11
d    19
dtype: int64

# DataFrame

In [2]:
import pandas as pd
from pandas import Series,DataFrame

In [3]:
data= {'state':['Ohio', 'Ohio', 'Ohio', 'Neveda', 'Neveda', 'Neveda'],
      'year':[2000,2001,2002,2000,2001,2002],
      'pop':[1.2,1.4,1.6,1.3,1.4,1.7]}

In [4]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.2
1    Ohio  2001  1.4
2    Ohio  2002  1.6
3  Neveda  2000  1.3
4  Neveda  2001  1.4
5  Neveda  2002  1.7

In [5]:
frame.head()

    state  year  pop
0    Ohio  2000  1.2
1    Ohio  2001  1.4
2    Ohio  2002  1.6
3  Neveda  2000  1.3
4  Neveda  2001  1.4

In [6]:
frame1 = pd.DataFrame(data, columns =['year','pop','state'])
frame1

   year  pop   state
0  2000  1.2    Ohio
1  2001  1.4    Ohio
2  2002  1.6    Ohio
3  2000  1.3  Neveda
4  2001  1.4  Neveda
5  2002  1.7  Neveda

In [7]:
frame2 = pd.DataFrame(data, columns =['year','pop','state','debt'],index=['one', 'two','three','four','five','six'])
frame2

       year  pop   state debt
one    2000  1.2    Ohio  NaN
two    2001  1.4    Ohio  NaN
three  2002  1.6    Ohio  NaN
four   2000  1.3  Neveda  NaN
five   2001  1.4  Neveda  NaN
six    2002  1.7  Neveda  NaN

In [8]:
frame2['year']

one      2000
two      2001
three    2002
four     2000
five     2001
six      2002
Name: year, dtype: int64

In [9]:
frame2.year

one      2000
two      2001
three    2002
four     2000
five     2001
six      2002
Name: year, dtype: int64

In [10]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Neveda
4    Neveda
5    Neveda
Name: state, dtype: object

In [11]:
frame2.loc['two']

year     2001
pop       1.4
state    Ohio
debt      NaN
Name: two, dtype: object

In [12]:
frame2

       year  pop   state debt
one    2000  1.2    Ohio  NaN
two    2001  1.4    Ohio  NaN
three  2002  1.6    Ohio  NaN
four   2000  1.3  Neveda  NaN
five   2001  1.4  Neveda  NaN
six    2002  1.7  Neveda  NaN

In [13]:
frame2['debt']= 12.5
frame2

       year  pop   state  debt
one    2000  1.2    Ohio  12.5
two    2001  1.4    Ohio  12.5
three  2002  1.6    Ohio  12.5
four   2000  1.3  Neveda  12.5
five   2001  1.4  Neveda  12.5
six    2002  1.7  Neveda  12.5

In [14]:
import numpy as np
frame2.debt=np.arange(6)
frame2

       year  pop   state  debt
one    2000  1.2    Ohio     0
two    2001  1.4    Ohio     1
three  2002  1.6    Ohio     2
four   2000  1.3  Neveda     3
five   2001  1.4  Neveda     4
six    2002  1.7  Neveda     5

In [15]:
val= pd.Series([13.1,14.0,15],index=['one','four',"six"])
frame2['debt']= pd.DataFrame(val)

In [16]:
frame2

       year  pop   state  debt
one    2000  1.2    Ohio  13.1
two    2001  1.4    Ohio   NaN
three  2002  1.6    Ohio   NaN
four   2000  1.3  Neveda  14.0
five   2001  1.4  Neveda   NaN
six    2002  1.7  Neveda  15.0

In [17]:
frame2['eastern']=frame2.state=='Ohio'

In [18]:
frame2

       year  pop   state  debt  eastern
one    2000  1.2    Ohio  13.1     True
two    2001  1.4    Ohio   NaN     True
three  2002  1.6    Ohio   NaN     True
four   2000  1.3  Neveda  14.0    False
five   2001  1.4  Neveda   NaN    False
six    2002  1.7  Neveda  15.0    False

In [19]:
pop = {'Ohio':{2001:2.1, 2002:2.3,}, 
      'Neveda':{2000:2.2, 2001:2.3, 2002:2.4}}

In [20]:
frame2= pd.DataFrame(pop)

In [21]:
frame2

      Ohio  Neveda
2000   NaN     2.2
2001   2.1     2.3
2002   2.3     2.4

In [22]:
frame2.T

        2000  2001  2002
Ohio     NaN   2.1   2.3
Neveda   2.2   2.3   2.4

In [23]:
frame2

      Ohio  Neveda
2000   NaN     2.2
2001   2.1     2.3
2002   2.3     2.4

In [24]:
pdata= pd.DataFrame(pop, index =(2001,2002,2003))
pdata

      Ohio  Neveda
2001   2.1     2.3
2002   2.3     2.4
2003   NaN     NaN

In [25]:
frame2

      Ohio  Neveda
2000   NaN     2.2
2001   2.1     2.3
2002   2.3     2.4

In [26]:
fdata = {'Ohio':frame2['Ohio'][:-1],
        'Neveda':frame2['Neveda'][:2]}

In [27]:
frame3 = pd.DataFrame(fdata)
frame3

      Ohio  Neveda
2000   NaN     2.2
2001   2.1     2.3

In [28]:
frame2.index.name = 'year'; frame2.columns.name = 'state'

In [29]:
frame2

state  Ohio  Neveda
year
2000    NaN     2.2
2001    2.1     2.3
2002    2.3     2.4

In [30]:
frame3.values

array([[nan, 2.2],
       [2.1, 2.3]])

In [31]:
frame1.values

array([[2000, 1.2, 'Ohio'],
       [2001, 1.4, 'Ohio'],
       [2002, 1.6, 'Ohio'],
       [2000, 1.3, 'Neveda'],
       [2001, 1.4, 'Neveda'],
       [2002, 1.7, 'Neveda']], dtype=object)

In [48]:
obj = pd.Series(range(3), index=['a','b','c'])

In [49]:
index= obj.index

In [50]:
index[1:]

Index(['b', 'c'], dtype='object')

In [51]:
index[1] ='a'

TypeError: Index does not support mutable operations

In [31]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [38]:
labels= pd.Index(np.arange(3))

In [39]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [40]:
gdata = pd.Series([11,12,13], index = labels)

In [30]:
gdata

0    11
1    12
2    13
dtype: int64

In [41]:
gdata.index is labels

True

In [42]:
3 in gdata.index

False

In [43]:
2 in gdata.index

True

In [45]:
13 in gdata.values

True